In [1]:
import numpy as np

In [2]:
import pandas as pd
import random

In [3]:
from numpy.random import randn

In [4]:
df = pd.DataFrame(randn(5,4),index= 'A B C D E'.split(" "),columns='X Y Z W'.split(' '))

In [5]:
df.head()

          X         Y         Z         W
A  0.454728  0.548932 -1.288888  0.583719
B  0.464245  0.515739  1.350189  0.800078
C  0.689743 -0.503122  1.759100  1.155013
D  0.449109  1.123001  0.450088  0.336222
E  0.155312  0.983355 -0.279938  1.244441

In [6]:
df = pd.DataFrame(randn(5,4),index= 'A B C D E'.split(" "),columns='X*Y*Z*W'.split('*'))

In [7]:
df[['X','W']]

          X         W
A -0.378085 -1.233029
B -0.961016  1.513574
C  0.934798 -1.276927
D  1.253230 -0.152316
E -0.919292  2.143517

In [8]:
df.iloc[0]

X   -0.378085
Y   -0.549398
Z    0.052697
W   -1.233029
Name: A, dtype: float64

In [9]:
df.iloc[1 : 5]

          X         Y         Z         W
B -0.961016  0.333027  0.392522  1.513574
C  0.934798  2.154056 -1.507794 -1.276927
D  1.253230  1.358071  0.268266 -0.152316
E -0.919292 -1.153424  0.369652  2.143517

In [10]:
df>-1

      X      Y      Z      W
A  True   True   True  False
B  True   True   True   True
C  True   True  False  False
D  True   True   True   True
E  True  False   True   True

In [12]:
new_columns_name = ['Col1','Col2','Col3','Col4']

In [15]:
df.columns = new_columns_name

In [16]:
df.head(1)

       Col1      Col2      Col3      Col4
A -0.378085 -0.549398  0.052697 -1.233029

In [18]:
df.isna().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    5 non-null      float64
 1   Col2    5 non-null      float64
 2   Col3    5 non-null      float64
 3   Col4    5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [ ]:
df.loc[['A','B']]